lab-2/RubyRails/app/controllers/student_page_controller.rb

  def index
    courses = Course.all
---
SELECT "courses".* FROM "courses"