app/views/courses/index.html.erb

SELECT "sections".* FROM "sections" WHERE (course_id = 155) ORDER BY "sections"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
        <tr>
          <% if not Section.where(["course_id = ?", course.id]).first %>

SELECT "sections".* FROM "sections" WHERE (course_id = 157)
---
                <tbody>
                <% Section.where(["course_id = ?", course.id]).each do |section| %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                      <% Graderassignment.where(["section_id = ?", section.id]).each do |assignment| %>
                        <%= User.find(assignment.student_id).email %>