app/controllers/courses_controller.rb

  def index
    @pagy, @courses = pagy(Course.all.order(params[:sort]))
    @pagy, @sections = pagy(Section.all)
---
SELECT "sections".* FROM "sections" WHERE (course_id='55')

  def delete_course
    if current_user.admin? and current_user.approved
      sections = Section.where("course_id=?", params[:id])
      sections.each do |section|
        Section.delete(section.id)
      end
      Course.delete(params[:id])
---
SELECT "sections".* FROM "sections" WHERE (course_id='1')
DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 42]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]

  def create
    new_course = params[:course]
    Course.create(Subject: new_course[:Subject], CourseNumber: new_course[:CourseNumber],
                  CourseName: new_course[:CourseName], Campus: new_course[:Campus], Career: new_course[:Career])
---
INSERT INTO "courses" ("Subject", "CourseNumber", "CourseName", "Campus", "Career", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["Subject", "Sex"], ["CourseNumber", 1], ["CourseName", "weeifn"], ["Campus", "wnf`"], ["Career", "w"], ["created_at", "2022-03-27 19:12:43.418524"], ["updated_at", "2022-03-27 19:12:43.418524"]]

  def edit
    course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    course = Course.find(params[:id])
    respond_to do |format|
      format.html do
        if course.update(params.require(:course).permit(:CourseName, :Subject, :CourseNumber, :Campus, :Career))
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "courses" SET "CourseNumber" = ?, "CourseName" = ?, "Campus" = ?, "Career" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["CourseNumber", 3434], ["CourseName", ""], ["Campus", "Detroit"], ["Career", "Hell"], ["updated_at", "2022-03-29 02:37:33.741652"], ["id", 1]]

  def populate_db(subject, campus, page, term, academic_career)
    clean_db
    url = "https://content.osu.edu/v2/classes/search?q=&"
    if subject != ""
      url = url + "&subject=" + subject
    end
    if campus != ""
      url = url + "&campus=" + campus
    end
    if page != ""
      url = url + "&page=" + page
    end
    if term != ""
      url = url + "&term=" + term
    end
    if academic_career != ""
      url = url + "&academic-career=" + academic_career
    end
    page_data = HTTParty.get(url)
    response = OpenStruct.new(page_data.parsed_response) # Response is of type Hash, made into OpenStruct
    response.data["courses"].each { |courseContainer| #Each "course" contains a course (hash) and sections (array)
      course = courseContainer["course"]
      newcourse = Course.new(Subject: course["subject"], CourseNumber: course["catalogNumber"],
                             CourseName: course["title"], Campus: course["campus"], Career: course["academicCareer"])
      newcourse.save
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1000]]
INSERT INTO "courses" ("Subject", "CourseNumber", "CourseName", "Campus", "Career", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)