app/controllers/users_controller.rb

  def approve_user
    user = User.find(params[:id])
    user.approved = 1
    if user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "approved" = ? WHERE "users"."id" = ?  [["approved", "<1 bytes of binary data>"], ["id", 3]]